---
kind: property
id: P:Autodesk.Revit.DB.RenderingSettings.ResolutionValue
source: html/b6d30b4e-7096-c7a7-9540-d7ab061064a6.htm
---
# Autodesk.Revit.DB.RenderingSettings.ResolutionValue Property

The rendering resolution in dots per inch (DPI).

## Syntax (C#)
```csharp
public int ResolutionValue { get; }
```